       IDENTIFICATION DIVISION.
       PROGRAM-ID. C04.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-F PIC X VALUE 'N'.
       PROCEDURE DIVISION.
       A-MAIN.
           PERFORM B-ONE THRU B-THREE
           GOBACK
           .
       B-ONE.
           CONTINUE
           .
       B-TWO.
           CONTINUE
           .
       B-THREE.
           CONTINUE
           .
       B-FOUR.
           CONTINUE
           .
