       IDENTIFICATION DIVISION.
       PROGRAM-ID. C05.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-F PIC X VALUE 'N'.
       PROCEDURE DIVISION.
       A-MAIN.
           CONTINUE
           .
       B-NEXT.
           CONTINUE
           .
       C-LAST.
           GOBACK
           .
